In [17]:
import pandas as pd

In [18]:
import matplotlib.pyplot as p

In [19]:
from sklearn.linear_model import LinearRegression

In [20]:
from sklearn.model_selection import train_test_split

In [21]:
from sklearn.metrics import r2_score

In [37]:
a=pd.read_csv('C:/Users/Shruti Deshpande/Downloads/Visitor_Prediction_Multiple_Linear_Regression_data.csv')

In [38]:
a.keys()

Index(['Date', 'Views_show', 'Visitors', 'Views_platform', 'Ad_impression',
       'Cricket_match_india', 'Character_A', 'Unnamed: 7'],
      dtype='object')

In [39]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 8 columns):
Date                   80 non-null object
Views_show             80 non-null int64
Visitors               80 non-null int64
Views_platform         80 non-null int64
Ad_impression          80 non-null int64
Cricket_match_india    80 non-null int64
Character_A            80 non-null int64
Unnamed: 7             0 non-null float64
dtypes: float64(1), int64(6), object(1)
memory usage: 5.1+ KB

In [42]:
a.head(10)

,Date,Views_show,Visitors,Views_platform,Ad_impression,Cricket_match_india,Character_A,Unnamed: 7
0,3/1/2017,183738,1260228,1706478,1060860448,0,0,NaN
1,3/2/2017,193763,1270561,1690727,1031846645,0,0,NaN
2,3/3/2017,210479,1248183,1726157,1010867575,0,0,NaN
3,3/4/2017,240061,1492913,1855353,1079194579,1,0,NaN
4,3/5/2017,446314,1594712,2041418,1357736987,0,0,NaN
5,3/6/2017,342997,1330689,1742540,1140228426,0,0,NaN
6,3/7/2017,227313,1363579,1821742,1113811802,0,0,NaN
7,3/8/2017,180313,1353483,1795456,1083475096,0,0,NaN
8,3/9/2017,178800,1345428,1794157,1067636147,0,0,NaN
9,3/10/2017,201180,1344540,1834967,1081234843,0,0,NaN

In [43]:
a.drop('Unnamed: 7',axis=1,inplace=True)

In [44]:
a.head()

,Date,Views_show,Visitors,Views_platform,Ad_impression,Cricket_match_india,Character_A
0,3/1/2017,183738,1260228,1706478,1060860448,0,0
1,3/2/2017,193763,1270561,1690727,1031846645,0,0
2,3/3/2017,210479,1248183,1726157,1010867575,0,0
3,3/4/2017,240061,1492913,1855353,1079194579,1,0
4,3/5/2017,446314,1594712,2041418,1357736987,0,0

In [48]:
x=a.drop(a.columns[[0,2]],axis=1)
y=a.Visitors

In [49]:
x

,Views_show,Views_platform,Ad_impression,Cricket_match_india,Character_A
0,183738,1706478,1060860448,0,0
1,193763,1690727,1031846645,0,0
2,210479,1726157,1010867575,0,0
3,240061,1855353,1079194579,1,0
4,446314,2041418,1357736987,0,0
...,...,...,...,...,...
75,313945,2226788,1398052759,1,0
76,185689,2199844,1311961223,1,0
77,142260,2225752,1248266254,1,0
78,135871,2302789,1284859759,1,0
79,108961,2279036,1246026846,1,0

In [50]:
y

0     1260228
1     1270561
2     1248183
3     1492913
4     1594712
       ...
75    1808684
76    1814227
77    1755803
78    1749654
79    1746735
Name: Visitors, Length: 80, dtype: int64

In [51]:
x_train,x_test,y_train,y_test=train_test_split(x,y,train_size=0.2,random_state=15)

In [52]:
r=LinearRegression()

In [53]:
r.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [54]:
pr=r.predict(x_test)

In [55]:
pr

array([2003182.83865986, 1436841.83607924, 1592145.418069  ,
       1911766.85064701, 1829810.51119998, 1719751.13499504,
       1405615.22474212, 1807247.68190753, 1584914.5045121 ,
       1789811.03965235, 1805939.54966998, 1647430.22951761,
       1729102.21688245, 1672150.17714633, 1888784.19213187,
       1416222.42621341, 2007643.13655645, 1667432.33807039,
       2155152.23908482, 1683781.62526434, 1465818.86608172,
       1807996.30134916, 1915586.10329185, 1374932.83834052,
       1458361.36278264, 1813848.68049965, 1977041.92734338,
       2125496.37140823, 1799152.90779036, 1742140.04277522,
       1515883.62883136, 2081984.20968234, 1783151.1373992 ,
       1747324.23035218, 1311134.11233679, 1376966.08003298,
       1557383.22517351, 1602449.14166262, 1729304.7440883 ,
       1867175.48724492, 1563105.62295227, 2053736.94686953,
       1837443.73629781, 1714873.03168597, 1393612.27322291,
       1664451.84449021, 2259364.8926091 , 1539964.17036388,
       1738803.37356755, 1573829.96375683, 1543440.61534562,
       1754318.80599327, 1765700.28932637, 1286597.59523383,
       1777053.33115562, 1753524.39997943, 1701694.7905729 ,
       1863714.14900257, 1685163.20952471, 1546339.60870656,
       1441207.06780319, 1780877.17038162, 1504585.1126571 ,
       1559381.61838431])

In [58]:
pr[5]

1719751.1349950437

In [67]:
y_test

74    2135756
30    1588526
36    1589841
59    1953231
61    1904704
       ...
29    1630580
13    1459500
44    1697655
19    1528669
37    1568119
Name: Visitors, Length: 64, dtype: int64

In [61]:
b=r2_score(y_test,pr)
b

0.9121325436838482